zephyrproject-rtos/hal_infineon/dts/infineon/tc3x/tc39x-irq.h
#define IRQ_GTM_MCSW2 1014
#define IRQ_GTM_MCSW3 1015
#define IRQ_GTM_MCSW4 1016
#define IRQ_GTM_MCSW5 1017
#define IRQ_GTM_MCSW6 1018
#define IRQ_GTM_MCSW7 1019
#define IRQ_GTM_MCSW8 1020
#define IRQ_GTM_MCSW9 1021
#define IRQ_P00_0_TIM5_4 IRQ_GTM_TIM5_4
#define IRQ_P00_0_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P00_0_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P00_1_TIM5_5 IRQ_GTM_TIM5_5
#define IRQ_P00_1_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P00_1_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P00_2_TIM5_6 IRQ_GTM_TIM5_6
#define IRQ_P00_2_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P00_2_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P00_3_TIM5_7 IRQ_GTM_TIM5_7
#define IRQ_P00_3_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P00_3_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P00_4_TIM6_4 IRQ_GTM_TIM6_4
#define IRQ_P00_4_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P00_4_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P00_5_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P00_5_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P00_5_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P00_6_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P00_6_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P00_6_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P00_7_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P00_7_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P00_7_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P00_8_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P00_8_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P00_8_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P00_9_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P00_9_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P00_9_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P00_10_TIM4_1 IRQ_GTM_TIM4_1
#define IRQ_P00_10_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P00_10_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P00_11_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P00_11_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P00_11_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P00_12_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P00_12_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P00_12_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P02_0_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P02_0_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P02_1_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P02_1_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P02_2_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P02_2_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P02_3_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P02_3_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P02_4_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P02_4_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P02_5_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P02_5_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P02_6_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P02_6_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P02_6_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P02_7_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P02_7_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P02_7_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P02_8_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P02_8_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P02_8_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P10_0_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P10_0_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P10_0_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P10_1_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P10_1_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P10_1_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P10_2_TIM4_5 IRQ_GTM_TIM4_5
#define IRQ_P10_2_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P10_2_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P10_3_TIM4_6 IRQ_GTM_TIM4_6
#define IRQ_P10_3_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P10_3_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P10_4_TIM4_7 IRQ_GTM_TIM4_7
#define IRQ_P10_4_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P10_4_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P10_5_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P10_5_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P10_5_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P10_6_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P10_6_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P10_6_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P10_7_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P10_7_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P10_8_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P10_8_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P10_8_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P11_0_TIM7_5 IRQ_GTM_TIM7_5
#define IRQ_P11_0_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P11_0_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P11_1_TIM7_6 IRQ_GTM_TIM7_6
#define IRQ_P11_1_TIM4_1 IRQ_GTM_TIM4_1
#define IRQ_P11_1_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P11_2_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P11_2_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P11_3_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P11_3_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P11_4_TIM7_7 IRQ_GTM_TIM7_7
#define IRQ_P11_4_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P11_4_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P11_5_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P11_5_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P11_6_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P11_6_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P11_7_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P11_7_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P11_8_TIM4_5 IRQ_GTM_TIM4_5
#define IRQ_P11_8_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P11_9_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P11_9_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P11_10_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P11_10_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P11_10_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P11_11_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P11_11_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P11_11_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P11_12_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P11_12_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P11_13_TIM4_6 IRQ_GTM_TIM4_6
#define IRQ_P11_13_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P11_14_TIM4_7 IRQ_GTM_TIM4_7
#define IRQ_P11_14_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P11_15_TIM4_7 IRQ_GTM_TIM4_7
#define IRQ_P11_15_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P12_0_TIM7_3 IRQ_GTM_TIM7_3
#define IRQ_P12_0_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P12_0_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P12_1_TIM7_4 IRQ_GTM_TIM7_4
#define IRQ_P12_1_TIM4_1 IRQ_GTM_TIM4_1
#define IRQ_P12_1_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P14_0_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P14_0_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P14_1_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P14_1_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P14_2_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P14_2_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P14_3_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P14_3_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P14_4_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P14_4_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P14_5_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P14_5_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P14_6_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P14_6_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P14_7_TIM4_7 IRQ_GTM_TIM4_7
#define IRQ_P14_7_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P14_7_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P14_8_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P14_8_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P14_9_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P14_9_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P14_10_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P14_10_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P15_0_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P15_0_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P15_1_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P15_1_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P15_2_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P15_2_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P15_3_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P15_3_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P15_4_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P15_4_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P15_5_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P15_5_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P15_6_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P15_6_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P15_6_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P15_7_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P15_7_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P15_8_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P15_8_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P20_0_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P20_0_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P20_0_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P20_1_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P20_1_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P20_1_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P20_3_TIM4_5 IRQ_GTM_TIM4_5
#define IRQ_P20_3_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P20_3_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P20_6_TIM6_0 IRQ_GTM_TIM6_0
#define IRQ_P20_6_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P20_6_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P20_7_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P20_7_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P20_7_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P20_7_TIM6_1 IRQ_GTM_TIM6_1
#define IRQ_P20_8_TIM6_2 IRQ_GTM_TIM6_2
#define IRQ_P20_8_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P20_8_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P20_9_TIM6_3 IRQ_GTM_TIM6_3
#define IRQ_P20_9_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P20_9_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P20_10_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P20_10_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P20_11_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P20_11_TIM2_7 IRQ_GTM_TIM2_7
#define IRQ_P20_12_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P20_12_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P20_13_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P20_13_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P20_14_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P20_14_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P21_0_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P21_0_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P21_0_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P21_1_TIM4_1 IRQ_GTM_TIM4_1
#define IRQ_P21_1_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P21_1_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P21_2_TIM5_4 IRQ_GTM_TIM5_4
#define IRQ_P21_2_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P21_2_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P21_3_TIM5_5 IRQ_GTM_TIM5_5
#define IRQ_P21_3_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P21_3_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P21_4_TIM5_6 IRQ_GTM_TIM5_6
#define IRQ_P21_4_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P21_4_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P21_5_TIM5_7 IRQ_GTM_TIM5_7
#define IRQ_P21_5_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P21_5_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P21_6_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P21_6_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P21_6_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P21_7_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P21_7_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P21_7_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P22_0_TIM7_3 IRQ_GTM_TIM7_3
#define IRQ_P22_0_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P22_0_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P22_1_TIM7_2 IRQ_GTM_TIM7_2
#define IRQ_P22_1_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P22_1_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P22_2_TIM7_1 IRQ_GTM_TIM7_1
#define IRQ_P22_2_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P22_2_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P22_3_TIM7_0 IRQ_GTM_TIM7_0
#define IRQ_P22_3_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P22_3_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P22_4_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P22_5_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P22_6_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P22_6_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P22_7_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P22_8_TIM5_0 IRQ_GTM_TIM5_0
#define IRQ_P22_8_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P22_9_TIM5_1 IRQ_GTM_TIM5_1
#define IRQ_P22_9_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P22_10_TIM5_2 IRQ_GTM_TIM5_2
#define IRQ_P22_10_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P22_11_TIM5_3 IRQ_GTM_TIM5_3
#define IRQ_P22_11_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P23_0_TIM6_7 IRQ_GTM_TIM6_7
#define IRQ_P23_0_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P23_0_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P23_1_TIM6_6 IRQ_GTM_TIM6_6
#define IRQ_P23_1_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P23_1_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P23_2_TIM6_5 IRQ_GTM_TIM6_5
#define IRQ_P23_2_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P23_2_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P23_3_TIM6_4 IRQ_GTM_TIM6_4
#define IRQ_P23_3_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P23_3_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P23_4_TIM6_3 IRQ_GTM_TIM6_3
#define IRQ_P23_4_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P23_4_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P23_5_TIM6_2 IRQ_GTM_TIM6_2
#define IRQ_P23_5_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P23_5_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P23_6_TIM6_1 IRQ_GTM_TIM6_1
#define IRQ_P23_6_TIM4_2 IRQ_GTM_TIM4_2
#define IRQ_P23_6_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P23_7_TIM6_0 IRQ_GTM_TIM6_0
#define IRQ_P23_7_TIM4_3 IRQ_GTM_TIM4_3
#define IRQ_P23_7_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P32_0_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P32_0_TIM2_2 IRQ_GTM_TIM2_2
#define IRQ_P32_1_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P32_2_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P32_2_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P32_3_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P32_3_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P32_4_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P32_4_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P32_5_TIM5_5 IRQ_GTM_TIM5_5
#define IRQ_P32_5_TIM4_1 IRQ_GTM_TIM4_1
#define IRQ_P32_5_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P32_6_TIM5_6 IRQ_GTM_TIM5_6
#define IRQ_P32_6_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P32_6_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P32_7_TIM5_7 IRQ_GTM_TIM5_7
#define IRQ_P32_7_TIM4_0 IRQ_GTM_TIM4_0
#define IRQ_P32_7_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P33_0_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P33_0_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P33_0_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P33_1_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P33_1_TIM1_5 IRQ_GTM_TIM1_5
#define IRQ_P33_1_TIM0_5 IRQ_GTM_TIM0_5
#define IRQ_P33_2_TIM3_2 IRQ_GTM_TIM3_2
#define IRQ_P33_2_TIM1_6 IRQ_GTM_TIM1_6
#define IRQ_P33_2_TIM0_6 IRQ_GTM_TIM0_6
#define IRQ_P33_3_TIM3_3 IRQ_GTM_TIM3_3
#define IRQ_P33_3_TIM1_7 IRQ_GTM_TIM1_7
#define IRQ_P33_3_TIM0_7 IRQ_GTM_TIM0_7
#define IRQ_P33_4_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P33_4_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P33_4_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P33_5_TIM4_5 IRQ_GTM_TIM4_5
#define IRQ_P33_5_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P33_5_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P33_6_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P33_6_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P33_7_TIM1_3 IRQ_GTM_TIM1_3
#define IRQ_P33_7_TIM0_3 IRQ_GTM_TIM0_3
#define IRQ_P33_8_TIM1_4 IRQ_GTM_TIM1_4
#define IRQ_P33_8_TIM0_4 IRQ_GTM_TIM0_4
#define IRQ_P33_9_TIM1_1 IRQ_GTM_TIM1_1
#define IRQ_P33_9_TIM0_1 IRQ_GTM_TIM0_1
#define IRQ_P33_10_TIM4_4 IRQ_GTM_TIM4_4
#define IRQ_P33_10_TIM1_0 IRQ_GTM_TIM1_0
#define IRQ_P33_10_TIM0_0 IRQ_GTM_TIM0_0
#define IRQ_P33_11_TIM1_2 IRQ_GTM_TIM1_2
#define IRQ_P33_11_TIM0_2 IRQ_GTM_TIM0_2
#define IRQ_P33_12_TIM3_0 IRQ_GTM_TIM3_0
#define IRQ_P33_12_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P33_13_TIM3_1 IRQ_GTM_TIM3_1
#define IRQ_P33_13_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P33_14_TIM5_0 IRQ_GTM_TIM5_0
#define IRQ_P33_14_TIM4_5 IRQ_GTM_TIM4_5
#define IRQ_P33_14_TIM2_0 IRQ_GTM_TIM2_0
#define IRQ_P33_15_TIM5_1 IRQ_GTM_TIM5_1
#define IRQ_P33_15_TIM4_6 IRQ_GTM_TIM4_6
#define IRQ_P33_15_TIM2_1 IRQ_GTM_TIM2_1
#define IRQ_P34_1_TIM5_3 IRQ_GTM_TIM5_3
#define IRQ_P34_1_TIM3_4 IRQ_GTM_TIM3_4
#define IRQ_P34_1_TIM2_3 IRQ_GTM_TIM2_3
#define IRQ_P34_2_TIM5_4 IRQ_GTM_TIM5_4
#define IRQ_P34_2_TIM3_5 IRQ_GTM_TIM3_5
#define IRQ_P34_2_TIM2_4 IRQ_GTM_TIM2_4
#define IRQ_P34_3_TIM5_5 IRQ_GTM_TIM5_5
#define IRQ_P34_3_TIM3_6 IRQ_GTM_TIM3_6
#define IRQ_P34_3_TIM2_5 IRQ_GTM_TIM2_5
#define IRQ_P34_4_TIM5_6 IRQ_GTM_TIM5_6
#define IRQ_P34_4_TIM3_7 IRQ_GTM_TIM3_7
#define IRQ_P34_4_TIM2_6 IRQ_GTM_TIM2_6
#define IRQ_P34_5_TIM5_7 IRQ_GTM_TIM5_7
#define IRQ_P34_5_TIM4_7 IRQ_GTM_TIM4_7
#define IRQ_P34_5_TIM2_7 IRQ_GTM_TIM2_7
#endif
